app/controllers/school_classes_controller.rb

	def update
	  @school_class = SchoolClass.find(params[:id])
		@school_class.update(school_class_params(:title))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2019-07-27 22:09:18.108318"], ["id", 1]]